src/Providers/SimplissAbrasf_v2_03/envio_rps.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:ns1="http://www.sistema.com.br/Sistema.Ws.Nfse">
    <SOAP-ENV:Body>
        <ns1:GerarNfse/>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
