source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/PatrocinioMG.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<GerarNfse versao="3.00">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>http://wshomologacao.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>http://wspatrocinio.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/GerarNfse</WebActionHomologacao>
			<WebActionProducao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/GerarNfse</WebActionProducao>
			<SchemaArquivo>nfse_3.xsd</SchemaArquivo>
			<TagAssinatura>Prestador</TagAssinatura>
			<TagAtributoID>InformacaoNfse</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GerarNfse xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse">{xmlBody}<pParam><P1 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioUsuario}</P1><P2 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioSenha}</P2></pParam></GerarNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>GerarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.sistema.com.br/Nfse/arquivos/nfse_3.xsd</TargetNS>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
		</GerarNfse>
		<ConsultarNfsePorRps versao="3.00">
			<Descricao>Consultar NFSe por rps</Descricao>
			<WebEnderecoHomologacao>http://wshomologacao.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>http://wspatrocinio.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/ConsultarNfsePorRps</WebActionHomologacao>
			<WebActionProducao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/ConsultarNfsePorRps</WebActionProducao>
			<SchemaArquivo>nfse_3.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<TagExtraAssinatura></TagExtraAssinatura>
			<TagExtraAtributoID></TagExtraAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfsePorRps xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse">{xmlBody}<pParam><P1 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioUsuario}</P1><P2 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioSenha}</P2></pParam></ConsultarNfsePorRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarNfsePorRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.sistema.com.br/Nfse/arquivos/nfse_3.xsd</TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarLoteRps versao="3.00">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao>http://wshomologacao.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>http://wspatrocinio.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/ConsultarLoteRps</WebActionHomologacao>
			<WebActionProducao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/ConsultarLoteRps</WebActionProducao>
			<SchemaArquivo>nfse_3.xsd</SchemaArquivo>
			<TagAssinatura>ConsultarLoteRpsEnvio</TagAssinatura>
			<TagAtributoID>Protocolo</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarLoteRps xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse">{xmlBody}<pParam><P1 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioUsuario}</P1><P2 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioSenha}</P2></pParam></ConsultarLoteRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarLoteRpsResult</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.sistema.com.br/Nfse/arquivos/nfse_3.xsd</TargetNS>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
		</ConsultarLoteRps>
		<CancelarNfse versao="3.00">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao>http://wshomologacao.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>http://wspatrocinio.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/CancelarNfse</WebActionHomologacao>
			<WebActionProducao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/CancelarNfse</WebActionProducao>
			<SchemaArquivo>nfse_3.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNfse xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse">{xmlBody}<pParam><P1 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioUsuario}</P1><P2 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioSenha}</P2></pParam></CancelarNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>CancelarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.sistema.com.br/Nfse/arquivos/nfse_3.xsd</TargetNS>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
		</CancelarNfse>
		<ConsultarSituacaoLoteRps versao="3.00">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao>http://wshomologacao.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>http://wspatrocinio.simplissweb.com.br/nfseservice.svc?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/ConsultarSituacaoLoteRps</WebActionHomologacao>
			<WebActionProducao>http://www.sistema.com.br/Sistema.Ws.Nfse/INfseService/ConsultarSituacaoLoteRps</WebActionProducao>
			<SchemaArquivo>nfse_3.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarSituacaoLoteRps xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse">{xmlBody}<pParam><P1 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioUsuario}</P1><P2 xmlns="http://www.sistema.com.br/Sistema.Ws.Nfse.Cn">{MunicipioSenha}</P2></pParam></ConsultarSituacaoLoteRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarSituacaoLoteRpsResult</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.sistema.com.br/Nfse/arquivos/nfse_3.xsd</TargetNS>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
		</ConsultarSituacaoLoteRps>
		<GerarNfse versao="1.01">
			<Descricao>Envio do DPS - Sincrono</Descricao>
			<RequestURIProducao></RequestURIProducao>
			<RequestURIHomologacao>https://producaorestrita.simplissweb.com.br/nfse</RequestURIHomologacao>
			<MetodoAPI>post</MetodoAPI>
			<WebActionProducao>dpsXmlGZipB64</WebActionProducao>
			<TagAssinatura>DPS</TagAssinatura>
			<TagAtributoID>infDPS</TagAtributoID>
			<WebSoapString></WebSoapString>
			<SchemaArquivo>DPS_v1.01.xsd</SchemaArquivo>
			<WebContentType>application/json</WebContentType>
			<WebTagRetorno>nfseXmlGZipB64</WebTagRetorno>
			<TargetNS>http://www.sped.fazenda.gov.br/nfse</TargetNS>
			<SchemaVersao>1.01</SchemaVersao>
			<GZIPCompress>true</GZIPCompress>
			<LoginConexao>false</LoginConexao>
			<UsaCertificadoDigital>true</UsaCertificadoDigital>
		</GerarNfse>
		<CancelarNfse versao="1.01">
			<Descricao>Envio do cancelamento de NFSe</Descricao>
			<RequestURIProducao></RequestURIProducao>
			<RequestURIHomologacao>https://producaorestrita.simplissweb.com.br/nfse/{Chave}/eventos</RequestURIHomologacao>
			<MetodoAPI>post</MetodoAPI>
			<WebActionProducao>pedidoRegistroEventoXmlGZipB64</WebActionProducao>
			<TagAssinatura>pedRegEvento</TagAssinatura>
			<TagAtributoID>infPedReg</TagAtributoID>
			<WebSoapString></WebSoapString>
			<WebContentType>application/json</WebContentType>
			<WebTagRetorno>eventoXmlGZipB64</WebTagRetorno>
			<SchemaVersao>1.01</SchemaVersao>
			<GZIPCompress>true</GZIPCompress>
			<LoginConexao>false</LoginConexao>
			<UsaCertificadoDigital>true</UsaCertificadoDigital>
		</CancelarNfse>
	</Servicos>
</Configuracoes>